x = data.frame(이름=c('A','B','C','D'),
               성별=c('M','F','M','F'),
               월급=c(360,430,510,390),
               동호회=c(T,F,F,F)); x

str(x) #structure를 의미(몇열 of 몇행)

x <- data.frame(수학=c(73, 83, 92, 87, ), 
                영어=c(79, 84, , 91, 83), 
                성별=c('M','F', 'M', 'F', 'M'))

x <- data.frame(수학=c(73, 83, 92, 87, NA), 
                영어=c(79, 84, NA, 91, 83), 
                성별=c('M','F', 'M', 'F', 'M')) ; x
#결측값 입력

x <- data.frame(이름=c('이**', '김**', '박**', '정**'), 
                성별=c('M', 'F', 'M', 'F'),
                월급=c(360, 430, 510, 390), 
                동호회=c(T, F, F, F) ); x
x[4,3]
x[4,3,drop=F] #데이터 프레임 형식 유지하면서 출력
x$성별
x[,2]
x[,c("성별")]
x[,c("이름","월급")]
x[4,c("이름","월급")]
x[2,]
x[c(2,4),3,drop=F]

x[-1,-2] #-는 제외시키겠다는 의미

x <- data.frame(이름=c('이**', '김**', '박**', '정**'), 성별=c('M', 'F', 'M', 'F'),
월급=c(360, 430, 510, 390), 동호회=c(T, F, F, F) )

x[c(2,4),c("이름","월급")]

월급 = c(360,420,480,230,465,390) ; sort(월급)
sort(월급, decreasing=T)

x <- data.frame(성별=c('M', 'F', 'M', 'F', 'F', 'M'),
                월급=c(360, 420, 480, 320, 465, 390), 
                지출=c(320, 270, 260, 280, 350, 230) ); x
str(x) #필수 과정

sort(x$월급)
order(x$월급) #오름차순, 해당 순위인 index를 출력해준다
x = x[order(x$월급),];x #오름차순 순위로 index 교체하는 작업
rownames(x) = NULL;x #인덱스 초기화

x = x[order(x$성별, x$월급),];x #성별에 따른 월급을 구분
rownames(x) = NULL;x

x = x[order(x$월급,x$성별),];x #월급에 따른 성별을 구분(이 데이터 내에선 그냥 월급 기준 정렬이나 마찬가지
x = x[order(x$성별,x$월급,decreasing=T),];x
x[order(x$성별,-x$월급,decreasing=T),];x #일부만 내림차순

nation = c(
  "대한민국",
  "이스라엘",
  "일본",
  "튀르키예",
  "캐나다",
  "멕시코",
  "미국",
  "칠레",
  "콜롬비아",
  "코스타리카",
  "오스트리아",
  "벨기에",
  "체코",
  "덴마크",
  "에스토니아",
  "핀란드",
  "프랑스",
  "독일",
  "그리스",
  "헝가리",
  "아이슬란드",
  "아일랜드",
  "이탈리아",
  "라트비아",
  "리투아니아",
  "룩셈부르크",
  "네덜란드",
  "노르웨이",
  "폴란드",
  "포르투갈",
  "슬로바키아",
  "슬로베니아",
  "스페인",
  "스웨덴",
  "스위스",
  "영국",
  "오스트레일리아",
  "뉴질랜드"); nation

GDP_by1 = c(
  31637,
  43611,
  NA,
  8538,
  43242,
  8347,
  63544,
  13232,
  5333,
  12077,
  48105,
  44594,
  22762,
  60909,
  23312,
  49041,
  38625,
  45724,
  17676,
  15899,
  59261,
  83813,
  31676,
  17620,
  19998,
  115874,
  52304,
  67294,
  15656,
  22440,
  19157,
  25180,
  27057,
  51926,
  86602,
  40285,
  51812,
  41792
); GDP_by1

GDP_Improve = c(
  -0.9,
  -2.4,
  NA,
  1.8,
  -5.4,
  -8.2,
  -3.5,
  -5.8,
  -6.8,
  -4.5,
  -6.6,
  -6.3,
  -5.6,
  -2.7,
  -2.9,
  -2.8,
  -8.1,
  -4.9,
  -8.2,
  -5,
  -6.6,
  3.4,
  -8.9,
  -3.6,
  -0.9,
  -1.3,
  -3.7,
  -0.8,
  -2.7,
  -7.6,
  -4.8,
  -5.5,
  -10.8,
  -2.8,
  -2.9,
  -9.8,
  -0.3,
  1
); GDP_Improve

Fired = c(
  4,
  4.3,
  2.8,
  13.1,
  9.5,
  4.5,
  8.1,
  11.2,
  15,
  17.4,
  5.4,
  5.6,
  2.6,
  5.6,
  6.8,
  7.8,
  8,
  3.8,
  16.3,
  4.3,
  5.5,
  5.6,
  9.2,
  8.1,
  8.5,
  6.8,
  3.8,
  4.4,
  3.2,
  6.8,
  6.7,
  5,
  15.5,
  8.3,
  4.8,
  NA,
  6.5,
  4.6
); Fired

result = data.frame(nation,GDP_by1,GDP_Improve,Fired); result
str(result)

result1 = result[order(result$GDP_by1,decreasing=T),]; result1
rownames(result1) = NULL; result1

result2 = result[order(result$Fired),]; result2
rownames(result2) = NULL; result2

population = c(51781,8656,126476,84339,37742,128933,331003,19116,50883,5094,9006,11590,10709,5792,1327,5541,65274,83784,10423,9660,341,4938,60462,1886,2722,626,17135,5421,37847,10197,5460,2079,46755,10099,8655,67886,25500,4822); population

result3 = cbind(result,population); result3

x <- data.frame(
  key=c('룩셈부르크', '스위스', '노르웨이', '아일랜드', '아이슬란드', '미국', '덴마크', '오스트레일리아', '스웨덴', '네덜란드'),
  GDP=c(114340, 82839, 81807, 77450, 73191, 62641, 60596, 57305, 54112,
        52978)
)
y <- data.frame(
  key=c('아이슬란드', '덴마크', '룩셈부르크', '노르웨이', '한국', '영국', '네덜란드', '스웨덴', '독일', '에스토니아'),
  인터넷=c(99.0, 97.6, 97.1, 96.5, 95.9, 94.9, 94.7, 92.1, 89.7, 89.4)
)

merge(x,y)
merge(x,y,by='key')
merge(x,y,all=T)
merge(x,y,all.x=T)
merge(x,y,all.y=T)

View(result3)
